:PROPERTIES:
:ID:       5dd16ee4-a99e-495e-b0ed-e5cbcc42a6b4
:END:
#+title: Lists

* Definition
- Indexed sequence of values
- Can be different [[id:72f40898-b06c-4c82-b670-b892182657a9][data types]]
- Variable-length
- Mutable

* Slicing
#+begin_src python
x = [1, 2, 3, 4, 5]
y = x[:] # y = [1, 2, 3, 4, 5]
z = x[1:3] # z = [2, 3, 4]
#+end_src


* Example
#+begin_src python :results output
# Create empty list
fruits = []

# Add values to the list
fruits += ['apple']
fruits += ['banana']
fruits.append('orange')

print(fruits)
#+end_src

#+RESULTS:
: ['apple', 'banana', 'orange']
